[
  {
    "id": 1,
    "companyLogo": "https://dummyimage.com/150x150/000/fff.png&text=ABC",
    "companyName": "ABC Corp.",
    "jobPosition": "Full-stack Developer",
    "onsetOrRemote": "Onset",
    "fullOrPartTime": "Full-time",
    "jobDescription": "We are looking for a full-stack developer to join our team. In this role, you will be responsible for designing and developing software solutions that meet customer needs.",
    "jobResponsibilities": "Design and develop software solutions. Collaborate with cross-functional teams to define, design, and ship new features. Write clean, efficient, and well-documented code. Troubleshoot and debug issues. Stay up-to-date with emerging trends and technologies in software development.",
    "educationalRequirements": "Bachelor's degree in Computer Science, Software Engineering, or a related field",
    "experienceRequirements": "At least 3 years of experience in software development",
    "phone": "+1 (123) 456-7890",
    "email": "careers@abccorp.com",
    "address": "123 Main Street, Suite 100, Anytown, USA"
  },
  {
    "id": 2,
    "companyLogo": "https://dummyimage.com/150x150/000/fff.png&text=DEF",
    "companyName": "DEF Solutions",
    "jobPosition": "DevOps Engineer",
    "onsetOrRemote": "Onset",
    "fullOrPartTime": "Full-time",
    "jobDescription": "We are seeking a skilled DevOps engineer to join our team. In this role, you will be responsible for implementing and maintaining the automation of software delivery and infrastructure.",
    "jobResponsibilities": "Design and implement build, deployment, and configuration management. Test implemented designs. Build and test automation tools for infrastructure provisioning. Handle code deployments in all environments. Monitor metrics and develop ways to improve. Work collaboratively with software engineering to deploy and operate systems. Help automate and streamline operations and processes. Build and maintain tools for deployment, monitoring, and operations.",
    "educationalRequirements": "Bachelor's degree in Computer Science, Software Engineering, or a related field",
    "experienceRequirements": "At least 2 years of experience in DevOps or a related field",
    "phone": "+1 (234) 567-8901",
    "email": "careers@defsolutions.com",
    "address": "456 Broadway, Suite 200, Anytown, USA"
  },
  {
    "id": 3,
    "companyLogo": "https://dummyimage.com/150x150/000/fff.png&text=GHI",
    "companyName": "GHI Corp.",
    "jobPosition": "UI/UX Designer",
    "onsetOrRemote": "Remote",
    "fullOrPartTime": "Full-time",
    "jobDescription": "We are seeking a talented UI/UX designer to join our team. In this role, you will be responsible for designing and implementing user interfaces for our software products.",
    "jobResponsibilities": "Design and implement user interfaces. Create wireframes, storyboards, user flows, and process flows. Work collaboratively with product managers and software engineers. Identify and troubleshoot UX problems. Conduct user research and evaluate user feedback. Stay up-to-date with emerging trends and technologies in UI/UX design.",
    "educationalRequirements": "Bachelor's degree in Graphic Design, Human-Computer Interaction, or a related field",
    "experienceRequirements": "At least 2 years of experience in DevOps or a related field",
    "phone": "+1 (234) 567-8901",
    "email": "careers@defsolutions.com",
    "address": "456 Broadway, Suite 200, Anytown, USA"
  },
  {
    "id": 7,
    "companyLogo": "https://dummyimage.com/150x150/000/fff.png&text=JKL",
    "companyName": "JKL Innovations",
    "jobPosition": "Software Engineer",
    "onsetOrRemote": "Onset",
    "fullOrPartTime": "Full-time",
    "jobDescription": "We are seeking a skilled software engineer to join our team. In this role, you will be responsible for developing and implementing software solutions for our products.",
    "jobResponsibilities": "Design and implement software solutions. Collaborate with cross-functional teams to define, design, and ship new features. Write clean, efficient, and well-documented code. Troubleshoot and debug issues. Stay up-to-date with emerging trends and technologies in software development.",
    "educationalRequirements": "Bachelor's degree in Computer Science, Software Engineering, or a related field",
    "experienceRequirements": "At least 2 years of experience in software development",
    "phone": "+1 (345) 678-9012",
    "email": "careers@jklinnovations.com",
    "address": "789 Oak Street, Suite 300, Anytown, USA"
  },
  {
    "id": 8,
    "companyLogo": "https://dummyimage.com/150x150/000/fff.png&text=MNO",
    "companyName": "MNO Technologies",
    "jobPosition": "Database Administrator",
    "onsetOrRemote": "Onset",
    "fullOrPartTime": "Full-time",
    "jobDescription": "We are seeking a skilled database administrator to join our team. In this role, you will be responsible for maintaining and optimizing our database systems.",
    "jobResponsibilities": "Install and configure database systems. Monitor database performance and troubleshoot issues. Implement and maintain security measures to protect data. Develop and maintain backup and recovery procedures. Perform database maintenance activities. Stay up-to-date with emerging trends and technologies in database administration.",
    "educationalRequirements": "Bachelor's degree in Computer Science, Information Systems, or a related field",
    "experienceRequirements": "At least 3 years of experience in database administration or a related field",
    "phone": "+1 (456) 789-0123",
    "email": "careers@mnotechnologies.com",
    "address": "123 Elm Street, Suite 400, Anytown, USA"
  },
  {
    "id": 9,
    "companyLogo": "https://dummyimage.com/150x150/000/fff.png&text=PQR",
    "companyName": "PQR Innovations",
    "jobPosition": "Mobile App Developer",
    "onsetOrRemote": "Remote",
    "fullOrPartTime": "Full-time",
    "jobDescription": "We are seeking a skilled mobile app developer to join our team. In this role, you will be responsible for developing and implementing mobile applications for iOS and Android platforms.",
    "jobResponsibilities": "Design and develop mobile applications. Collaborate with cross-functional teams to define, design, and ship new features. Write clean, efficient, and well-documented code. Troubleshoot and debug issues. Stay up-to-date with emerging trends and technologies in mobile app development.",
    "educationalRequirements": "Bachelor's degree in Computer Science, Software Engineering, or a related field",
    "experienceRequirements": "At least 2 years of experience in mobile app development",
    "phone": "+1 (456) 789-0123",
    "email": "careers@mnotechnologies.com",
    "address": "123 Elm Street, Suite 400, Anytown, USA"
  }
]